Repository: 27labs/rondas-relampago
Catalog: rondas_relampago/lib/l10n/app_*.arb
Languages: es

# gameName
source: Lightning Rounds!
es: ¡Rondas Relámpago!

# gameHook
source: The quick and fun game!
es: ¡El divertido juego rápido!

# ageConfirmationTitleText
source: Please Confirm Your Birth Year
es: Porfavor Confirma Tu Edad

# ageConfirmationNotice
source: Please confirm your age range here. This is for the sole purpose of the application presenting you age appropriate content. You must hit (Accept) if you: at least are of teen age and have the consent of your guardian if applicable. Otherwise hit (No).
es: Porfavor confirma tu rango de edad aquí. Esto es por el único motivo de hacer que la aplicación te muestre contenido acorde a tu edad. Debes presionar (Aceptar) si: por lo menos alcanzaste la adolecencia, y tienes el concentimiento de tus tutores cuando aplique. Para los otros casos presiona (No).

# confirmOlderText
source: Accept
es: Aceptar

# musicToggle
source: Toggle the music on or off
es: Cambiar la música entre encendido o apagado

# casualMode
source: Local 1 vs. 1
es: 1 vs. 1 Local

# competitiveMode
source: Competitive 1 vs. 1
es: 1 vs. 1 Competitivo

# onlineCasualMode
source: Online 1 vs. 1
es: 1 vs. 1 En Línea

source: Return to main menu
es: Regresar al menú principal

# continueText
source: Continue
es: Continuar

source: Privacy Policy
es: Política de Privacidad

source: Next Round
es: Próxima Ronda

source: Calculating...
es: Calculando...

# tutorialTitle
source: How to play
es: Cómo jugar

# roomSelectionTitleText
source: Join Room
es: Unirse a la Sala

# mayLeaveEmptyText
source: You may leave this field empty.
es: Puedes dejar este campo vacío.

# submitRoomIdText
source: Accept
es: Aceptar

# invalidRoomIdAlertText
source: That room identification is invalid.
es: Esa identificación para salas es invalida.

# roomIdCopiedText
source: Copied the room code to your clipboard!
es: ¡El código de la sala ahora está en tu portapapeles!

# inNoGameRoomText
source: IN NO ROOM AT THIS MOMENT
es: EN NINGUNA SALA EN ESTE MOMENTO

source: Select a small unit
es: Selecciona una unidad pequeña

source: Select a medium unit
es: Selecciona una unidad mediana

source: Select a large unit
es: Selecciona una unidad grande

source: This is a small horizontal piece
es: Esta es una pieza pequeña y horizontal

source: This is a small vertical piece
es: Esta es una pieza pequeña y vertical

source: This is a medium horizontal piece
es: Esta es una pieza mediana y horizontal

source: This is a medium vertical piece
es: Esta es una pieza mediana y vertical

source: This is a large horizontal piece
es: Esta es una pieza grande y horizontal

source: This is a large vertical piece
es: Esta es una pieza grande y vertical

source: This is a marker
es: Estos es un marcador

# selectTheVerticalOrientation
source: Select vertical as the orientation
es: Selecciona vertical para la orientación

# selectTheHorizontalOrientation
source: Select horizontal as the orientation
es: Selecciona horizontal para la orientación

# playerPlacingTitle
source: Place your pieces!
es: ¡Coloca tus piezas!

# p1PlacingTitle
source: Player 1, place your pieces!
es: Jugador 1, ¡coloca tus piezas!

# p2PlacingTitle
source: Player 2, place your pieces!
es: Jugador 2, ¡coloca tus piezas!

# playerGuessingTitle
source: Now, mark 4 squares on the board
es: Ahora, marca 4 casillas en el tablero

# p1GuessingTitle
source: Player 1, now mark 4 squares on the board
es: Jugador 1, ahora marca 4 casillas en el tablero

# p1CompetitiveGuessingTitle
source: Player 1, now mark the squares on the board
es: Jugador 1, ahora marca las casillas en el tablero

# p2GuessingTitle
source: Player 2, now mark 4 squares on the board
es: Jugador 2, ahora marca 4 casillas en el tablero

# p2CompetitiveGuessingTitle
source: Player 2, now mark the squares on the board
es: Jugador 2, ahora marca las casillas en el tablero

source: Markers left:
es: Marcadores restantes:

# wordCoordinate
source: Coordinates
es: Coordenadas

# wordMarkerYes
source: Marker: Yes
es: Marcador: Sí

# wordMarkerNo
source: Marker: No
es: Marcador: No

# wordUnit
source: Unit
es: Unidad

# wordNone
source: None
es: Ninguna

# wordBy
source: by
es: por

# thereIsNoPieceHere
source: You are trying to drag a piece that does not exist
es: Estás tratando de arrastrar una pieza que no existe

# boardSize
source: A board with the following dimensions:
es: Un tablero con las siguientes dimensiones:

source: The board is empty
es: El tablero está vacio

# smallUnitParse
source: A small unit in the coordinates:
es: Una unidad pequeña en las coordenadas:

# mediumUnitParse
source: A medium unit in the coordinates:
es: Una unidad mediana en las coordenadas:

# largeUnitParse
source: A large unit in the coordinates:
es: Una unidad grande en las coordenadas:

# markersInCoordinates
source: Markers in the coordinates:
es: Marcadores en las coordenadas:

# aMarkerInCoordinates
source: A marker in the coordinates:
es: Un marcador en las coordenadas:

# resultsTitle
source: These are the results!
es: ¡Estos son los resultados!

# p1IsWinner
source: Player 1 is the winner!
es: ¡El jugador 1 es el ganador!

# playerIsWinner
source: You won!
es: ¡Ganaste!

# p2IsWinner
source: Player 2 is the winner!
es: ¡El jugador 2 es el ganador!

# computerIsWinner
source: The Computer won!
es: ¡La Computadora ganó!

# coinFlipHeads
source: A coin flip says HEADS!
es: ¡Un tiro de moneda dice CARA!

# coinFlipTails
source: A coin flip says TAILS!
es: ¡Un tiro de moneda dice ESCUDO!

# thanks
source: Thanks 4 playing!
es: ¡Gracias X jugar!

# tied
source: It's a tie...
es: Ha sido empate...

source: Statistics
es: Estadísticas

# winsCounterText
source: Wins:
es: Victorias:

# winsPercentileText
source: Percentile:
es: Percentil:

source: P1 Results
es: Resultados J1

source: P2 Results
es: Resultados J2

# computerResults
source: CPU Results
es: Resultados CPU

source: Main Menu
es: Menú Principal

# themeWord
source: Theme
es: Tema

source: Red
es: Rojo

# redTheme
source: Theme with the color Red.
es: Tema basado en el color Rojo.

source: Green
es: Verde

# greenTheme
source: Theme with the color Green.
es: Tema basado en el color Verde.

source: Blue
es: Azul

# blueTheme
source: Theme with the color Blue.
es: Tema basado en el color Azul.

# playerOne
source: P1
es: J1

# playerTwo
source: P2
es: J2

# playerOneFull
source: Player 1
es: Jugador 1

# playerTwoFull
source: Player 2
es: Jugador 2

source: Results
es: Resultados

source: Check winner board.
es: Ver el tablero ganador.

# checkLoserBoard
source: Check the board that didn't win.
es: Ver el tablero que no ganó.

# check1stRoundBoard
source: Switch to the board from the first round.
es: Cambiar al tablero de la primera ronda.

# check2ndRoundBoard
source: Switch to the board from the second round.
es: Cambiar al tablero de la segunda ronda.

# check3rdRoundBoard
source: Switch to the board from the third round.
es: Cambiar al tablero de la tercera ronda.

# markerImage
source: assets/gifs/markers.gif
es: assets/gifs/marcadores.gif

# scrollImage
source: assets/gifs/scroll_eng.gif
es: assets/gifs/scroll_esp.gif

# pieceSizeAlert
source: Enough pieces of that size are already on the board. Try placing a piece that is a different size from those already on the board. For that, you may pick a size with the buttons below, and pick between (S)MALL, (M)EDIUM, or (L)ARGE.
es: Suficientes piezas de ese tamaño ya están en el tablero. Prueba colocar una pieza que sea de un tamaño diferente al de las que ya están en el tablero. Para eso, puedes seleccionar un tamaño con los botones aquí debajo, y elegir entre PEQUEÑO(S), MEDIANO(M), o GRANDE(L).

# tutorial
source: YO! I know you're gonna like this, so here is how you play Lightning! This game consists in three phases: 'PLACING PIECES' >>> 'GUESSING POSITIONS' >>> 'SEEING RESULTS'. > PLACING PIECES < In this phase, you must TOUCH THE BOARD to place your PIECES. The sizes are LARGE, MEDIUM, SMALL. And you can position them either VERTICALLY or HORIZONTALLY. You must place exactly one of each size in whichever orientation/size configuration you may choose. You can pick the size of piece you'd like to place by pressing the buttons that show up beneath the board. The same goes for the orientation. > GUESSING POSITIONS < In this phase, you must TOUCH THE BOARD to mark the squares on which you believe your opponent has a piece. All the players have FOUR MARKERS each and must place them all before passing the turn. Picking just one square that belongs to a piece is enough to claim the points for that piece. > RESULTS < Here you'll see who's the winner! The one who reaches more units wins! But the smaller they are the more points they're worth, in case there is a tie. You may see each player's board by pressing their button beneath the board. Good look to you! I hope you have a good time! -SB
es: ¡KLK! Yo sé que esto te va a gustar, ¡así que aquí va cómo se juega Relámpago! Este juego consta de tres fases: 'COLOCAR PIEZAS' >>> 'ADIVINAR POSICIONES' >>> 'VER RESULTADOS'. > COLOCAR PIEZAS < En esta fase, tienes que TOCAR EL TABLERO para colocar tus PIEZAS. Los tamaños son GRANDE(L), MEDIANO(M), PEQUEÑO(S). Y puedes orientarlas de manera VERTICAL u HORIZONTAL. Debes colocar exactamente una de cada tamaño en cualquier combinación de orientación/tamaño que elijas. Puedes seleccionar el tamaño de la pieza que quieras colocar presionando los botones que se muestran debajo del tablero. Lo mismo va para la orientación. > ADIVINAR POSICIONES < En esta fase, tienes que TOCAR EL TABLERO para marcar las casillas en las que crees que tu oponente tiene una pieza. Todos los jugadores tienen CUATRO MARCADORES cada uno y deben colocarlos todos antes de pasar el turno. Marcar una sola casilla que pertenezca a una pieza es suficiente para reclamar los puntos por esa pieza. > RESULTADOS < ¡Aquí verán quién es el ganador! ¡El que haya alcanzado más unidades gana! Pero mientras más pequeñas sean más puntos valen, para el caso en el que haya empate. Pueden ver el tablero de cada jugador presionando su botón debajo del tablero. ¡Buena Suerte! ¡Espero que este sea un buen rato! -SB

# tutorialForCompetitiveMode
source: YO! I know you're gonna like this, so here is how you play Lightning! This game consists in three phases: 'PLACING PIECES' >>> 'GUESSING POSITIONS' >>> 'SEEING RESULTS'. And for the competitive mode you must play 3 rounds. > PLACING PIECES < In this phase, you must TOUCH THE BOARD to place your PIECES. The sizes are LARGE, MEDIUM, SMALL. And you can position them either VERTICALLY or HORIZONTALLY. Here you have which pieces you must place for each round: (You may place them in whatever orientation/size configuration you may choose.) Round 1: (L: 1, M: 1, S: 1) Round 2: (L: 1, M: 2, S: 1) Round 3: (L: 2, M: 1, S: 2) You can pick the size of piece you'd like to place by pressing the buttons that show up beneath the board. The same goes for the orientation. > GUESSING POSITIONS < In this phase, you must TOUCH THE BOARD to mark the squares on which you believe your opponent has a piece. All the players have a total of 12 MARKERS each and may place them in whichever rounds they please. Picking just one square that belongs to a piece is enough to claim the points for that piece. > RESULTS < Here you'll see who's the winner! The one who reaches more units wins! But the smaller they are the more points they're worth, in case there is a tie. You may see each player's boards by pressing their button beneath the board. Good look to you! I hope you have a good time! -SB
es: ¡KLK! Yo sé que esto te va a gustar, ¡así que aquí va cómo se juega Relámpago! Este juego consta de tres fases: 'COLOCAR PIEZAS' >>> 'ADIVINAR POSICIONES' >>> 'VER RESULTADOS'. Y para el modo competitivo deben jugar 3 rondas. > COLOCAR PIEZAS < En esta fase, tienes que TOCAR EL TABLERO para colocar tus PIEZAS. Los tamaños son GRANDE(L), MEDIANO(M), PEQUEÑO(S). Y puedes orientarlas de manera VERTICAL u HORIZONTAL. Aquí están cuales piezas debes colocar para cada ronda: (Puedes colocarlas en cualquier combinación de orientación/tamaño que elijas.) Ronda 1: (L: 1, M: 1, S: 1) Ronda 2: (L: 1, M: 2, S: 1) Ronda 3: (L: 2, M: 1, S: 2) Puedes seleccionar el tamaño de la pieza que quieras colocar presionando los botones que se muestran debajo del tablero. Lo mismo va para la orientación. > ADIVINAR POSICIONES < En esta fase, tienes que TOCAR EL TABLERO para marcar las casillas en las que crees que tu oponente tiene una pieza. Todos los jugadores tienen 12 MARCADORES cada uno y pueden colocarlos todos en las rondas que les plazca. Marcar una sola casilla que pertenezca a una pieza es suficiente para reclamar los puntos por esa pieza. > RESULTADOS < ¡Aquí verán quién es el ganador! ¡El que haya alcanzado más unidades gana! Pero mientras más pequeñas sean más puntos valen, para el caso en el que haya empate. Pueden ver el tablero de cada jugador presionando su botón debajo del tablero. ¡Buena Suerte! ¡Espero que este sea un buen rato! -SB

# tutorial0
source: YO! I know you're gonna like this, so here is how you play Lightning! This game consists in three phases: 'PLACING PIECES' >>> 'GUESSING POSITIONS' >>> 'SEEING RESULTS'. > PLACING PIECES < In this phase, you must to place your PIECES on the BOARD.
es: ¡KLK! Yo sé que esto te va a gustar, ¡así que aquí va cómo se juega Relámpago! Este juego consta de tres fases: 'COLOCAR PIEZAS' >>> 'ADIVINAR POSICIONES' >>> 'VER RESULTADOS'. > COLOCAR PIEZAS < En esta fase, tienes que colocar tus PIEZAS en el TABLERO.

# tutorial1
source: The sizes are LARGE, MEDIUM, SMALL. And you can position them either VERTICALLY,
es: Los tamaños son GRANDE(L), MEDIANO(M), PEQUEÑO(S). Y puedes orientarlas de manera VERTICAL,

# tutorial2
source: or HORIZONTALLY.
es: y HORIZONTAL.

# tutorial3
source: You must place exactly one of each size. You can pick the size and orientation of piece you'd like to place by pressing the buttons that show up beneath the board. > GUESSING POSITIONS < In this phase, you must mark the squares on which you believe your opponent has a piece.
es: Debes colocar exactamente una de cada tamaño. Puedes seleccionar el tamaño y orientación de la pieza que quieras colocar presionando los botones que se muestran debajo del tablero. > ADIVINAR POSICIONES < En esta fase, tienes que marcar las casillas en las que crees que tu oponente tiene una pieza.

# tutorial4
source: All the players have FOUR MARKERS each and must place them all before passing their turn. Picking just one square that belongs to a piece is enough to claim the points for that piece. > RESULTS < Here you'll see who's the winner!
es: Todos los jugadores tienen CUATRO MARCADORES cada uno y deben colocarlos todos antes de pasar su turno. Marcar una sola casilla que pertenezca a una pieza es suficiente para reclamar los puntos por esa pieza. > RESULTADOS < ¡Aquí verán quién es el ganador!

# tutorial5
source: The one who reaches more units wins! But the smaller they are the more points they're worth, in case there is a tie. Good look to you! I hope you have a good time! -SB
es: ¡El que haya alcanzado más unidades gana! Pero mientras más pequeñas sean más puntos valen, para el caso en el que haya empate. ¡Buena Suerte! ¡Espero que este sea un buen rato! -SB
